In [22]:
import pandas as pd

In [23]:
titanic = pd.read_csv('data/short_titanic.csv')
titanic.head()

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",male,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0

In [24]:
titanic.shape

(891, 5)

In [25]:
import numpy as np
titanic['Sex'] = np.where(titanic['Sex'] == 'female', 1, 0)

In [36]:
titanic['Sex'].head()

0    0
1    1
2    1
3    1
4    0
Name: Sex, dtype: int32

In [27]:
titanic.describe()

         Survived      Pclass         Sex         Age
count  891.000000  891.000000  891.000000  714.000000
mean     0.383838    2.308642    0.352413   29.699118
std      0.486592    0.836071    0.477990   14.526497
min      0.000000    1.000000    0.000000    0.420000
25%      0.000000    2.000000    0.000000   20.125000
50%      0.000000    3.000000    0.000000   28.000000
75%      1.000000    3.000000    1.000000   38.000000
max      1.000000    3.000000    1.000000   80.000000

In [28]:
titanic.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
dtype: int64

In [29]:
print sum(titanic['Age'].isnull())

177

In [30]:
average_age = titanic['Age'].mean()
average_age

29.69911764705882

In [31]:
titanic['Age'].fillna(average_age, inplace = True)

In [32]:
print sum(titanic['Age'].isnull())

0

In [33]:
titanic.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
dtype: int64

In [34]:
titanic.head()

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",0,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0
2,1,3,"Heikkinen, Miss. Laina",1,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0
4,0,3,"Allen, Mr. William Henry",0,35.0

In [35]:
titanic.groupby('Sex')['Age'].mean()

Sex
0    30.505824
1    28.216730
Name: Age, dtype: float64